# Дан список словарей. Найти ТОП-2 самых дорогих товаров и вывести в том же формате.
from operator import itemgetter

a = [{'Товар1': 'Мука', 'цена': 20},
     {'Товар2': 'Соль', 'цена': 50},
     {'Товар3': 'Макороны', 'цена': 96},
     {'Товар4': 'Сковородка', 'цена': 2615},
     {'Товар5': 'Гречка', 'цена': 35},
     {'Товар6': 'Масло', 'цена': 67},
     {'Товар7': 'Вино', 'цена': 1500},
     {'Товар8': 'Молоко', 'цена': 83},
     {'Товар9': 'Лук', 'цена': 15},
     {'Товар10': 'Перец', 'цена': 37}]
a_sort = sorted(a, key=lambda x: x['цена'])
print('\n', a_sort[-1], '\n', a_sort[-2])


#a_sort = sorted(a, key=itemgetter('цена'))
#print('\n', a_sort[-1], '\n', a_sort[-2])






"""b = {}
c = []
d = 0
for i in range(len(a)):
    d = a[i]
    c.append(d.get('цена'))
    c.sort()
    d.copy()
    d.items()
    print(d)"""

# b.update(a[i])
# c.append(b.get('цена'))
# c.sort()

# for s in range():
