#Вывести на экран все чётные, кратные трём, значения в диапазоне от 1 до 123
a = input('Введите число: ')
for i in range(6, 123+1, 6):
    print(i)

#a = int(input('Введите число: '))
#b = int(input('Введите число: '))
#for i in range(a, b):
    #if i % 2 == 0 and i % 3 == 0:
        #print(i)
